export interface DirectoryEntry {
	id: string
	group?: string
	subGroup?: string
	department: string
	name?: string
	phones: string[]
	room?: string
}

export const DIRECTORY_DATA: DirectoryEntry[] = [
	{
		id: '1',
		department: 'Начальник',
		name: 'Бойко Юрій Володимирович',
		phones: ['521-35-14', '65-14'],
		room: 'к.111',
	},
	{
		id: '2',
		department: 'Приймальня',
		phones: ['521-35-14', '65-14', '259-70-61 (факс)'],
		room: 'к.111',
	},
	{
		id: '3',
		department: 'Головний інженер',
		name: 'Борецький Олександр Францович',
		phones: ['22-55'],
		room: 'к.111',
	},
	{
		id: '4',
		department: 'Сектор мережевих технологій',
		name: 'Мар’яновський Віталій Анатолійович',
		phones: ['521-33-47', '22-99', '63-47'],
		room: 'к.123',
	},
	{
		id: '5',
		group:
			"Сектор з ремонту та обслуговування комп'ютерної та оргтехніки підрозділів університету",
		subGroup: 'у Шевченківському районі',
		department:
			'Диспетчерська (головний корпус) (прийом/видача картриджів, техніки)',
		phones: ['239-34-04', '34-04'],
		room: 'к.101',
	},
	{
		id: '6',
		group:
			"Сектор з ремонту та обслуговування комп'ютерної та оргтехніки підрозділів університету",
		subGroup: 'у Шевченківському районі',
		department: 'Заправка картриджів, ремонт техніки',
		phones: ['37-04'],
		room: 'к.40',
	},
	{
		id: '7',
		group:
			"Сектор з ремонту та обслуговування комп'ютерної та оргтехніки підрозділів університету",
		subGroup: 'у Голосіївському районі',
		department: 'Ремонт техніки',
		phones: ['259-02-47', '22-20', '22-69'],
		room: 'к.114, к.125',
	},
	{
		id: '8',
		department: 'Лабораторія паралельних обчислень',
		phones: ['521-33-30', '22-78', '63-30'],
		room: 'к.108',
	},
	{
		id: '9',
		department: 'Сектор впровадження нових технологій',
		name: 'Загороднюк Сергій Петрович',
		phones: ['521-32-88', '62-88'],
		room: 'к.126',
	},
	{
		id: '10',
		department: 'Сектор автоматизації навчального процесу',
		name: 'Смелянська Тетяна Василівна',
		phones: ['521-33-56', '259-02-47', '22-35', '63-56'],
		room: 'к.113',
	},
	{
		id: '11',
		department:
			"Бюро підтримки користувачів централізованих комп'ютерних систем університету",
		name: 'Морозова Світлана Дмитрівна',
		phones: ['521-33-07', '63-07'],
		room: 'к.127',
	},
	{
		id: '12',
		department: 'Інформаційна підтримка сайту',
		name: 'Лаканцева Тетяна Володимирівна',
		phones: ['521-32-94', '22-83', '62-94'],
		room: 'к.112',
	},
	{
		id: '13',
		department: 'Матеріально-технічний сектор',
		phones: ['22-16'],
		room: 'к.127',
	},
	{
		id: '14',
		department: 'Черговий адміністратор мереж університету',
		phones: ['521-33-47', '63-47', '22-99'],
		room: 'к.123',
	},
	{
		id: '15',
		department: 'Технічна підтримка мережі гуртожитків',
		phones: ['521-32-50', '22-07', '62-50'],
		room: 'к.110 б',
	},
	{
		id: '16',
		department: 'Серверна ІОЦ (головний корпус)',
		phones: ['234-31-08', '239-34-04', '34-04'],
		room: 'к.101',
	},
]
