<<<<<<< HEAD
{
  "homepage": "Головна",
  "historypage": "Історія",
  "title": "Історія ІОЦ",
  "back": "Повернутись на головну",
  "sections": {
    "section1": {
      "title": "РОЗВИТОК ІНФРАСТРУКТУРИ ТА КАДРІВ (1976–1990)",
      "text": "У 1978 році було завершено будівництво окремої адмінбудівлі на вул. Володимирській, де з’явилися сучасні зали обчислювальних вузлів і читальні кімнати. Це дозволило збільшити кількість одночасно підключених користувачів із 30 до 200. Центр активно впроваджував ОС «ЕС ЕОМ», розробляв локальні мережі на базі ЕОМ «Універсал-1», а також організував перші курси з програмування для викладачів і студентів."
    },
    "section2": {
      "title": "ЗАСНУВАННЯ ТА ПЕРШІ КРОКИ (1965–1975)",
      "text": "У 1965 році на базі факультету кібернетики Київського університету імені Тараса Шевченка було створено перший у СРСР університетський обчислювальний центр. Метою нового підрозділу стало консолідувати комп’ютерні ресурси для розв’язання наукових і прикладних задач: від математичного моделювання до автоматизації дипломних досліджень. Першою машиною Центру став «Мінськ-22», на якій студенти та викладачі виконували обчислення вручну, обмінюючись магнітними стрічками."
    },
    "section3": {
      "title": "РОЗВИТОК ІНФРАСТРУКТУРИ ТА КАДРІВ (1976–1990)",
      "text": "У 1978 році було завершено будівництво окремої адмінбудівлі на вул. Володимирській, де з’явилися сучасні зали обчислювальних вузлів і читальні кімнати. Це дозволило збільшити кількість одночасно підключених користувачів із 30 до 200. Центр активно впроваджував ОС «ЕС ЕОМ», розробляв локальні мережі на базі ЕОМ «Універсал-1», а також організував перші курси з програмування для викладачів і студентів."
    },
    "section4": {
      "title": "ПЕРЕХІД ДО КЛІЄНТ-СЕРВЕРНИХ РІШЕНЬ (1991–2005)",
      "text": "Після відродження незалежної України Центр розширив спектр послуг: з’явилися власні лабораторії по мережевому адмініструванню та базах даних. У 1995 році було встановлено перший сервер UNIX, що дозволило запровадити клієнт–серверні архітектури для наукових проєктів із геофізики та обчислювальної лінгвістики. Одночасно розпочалися курси з C/C++, Java та пізніше — з Python, відкриваючи доступ до міжнародних стандартів програмування."
    },
    "section5": {
      "title": "РОЗВИТОК ІНФРАСТРУКТУРИ (1976–1990)",
      "text": "У 1978 році було завершено будівництво окремої адмінбудівлі на вул. Володимирській, де з’явилися сучасні зали обчислювальних вузлів і читальні кімнати. Це дозволило збільшити кількість одночасно підключених користувачів із 30 до 200. Центр активно впроваджував ОС «ЕС ЕОМ», розробляв локальні мережі на базі ЕОМ «Універсал-1», а також організував перші курси з програмування для викладачів і студентів."
    },
    "section6": {
      "title": "РОЗВИТОК ІНФРАСТРУКТУРИ (1976–1990)",
      "text": "У 1978 році було завершено будівництво окремої адмінбудівлі на вул. Володимирській, де з’явилися сучасні зали обчислювальних вузлів і читальні кімнати. Це дозволило збільшити кількість одночасно підключених користувачів із 30 до 200. Центр активно впроваджував ОС «ЕС ЕОМ», розробляв локальні мережі на базі ЕОМ «Універсал-1», а також організував перші курси з програмування для викладачів і студентів."
    },
    "section7": {
      "title": "Заснування та перші кроки (1965–1975)",
      "text": "У 1965 році на базі факультету кібернетики Київського університету імені Тараса Шевченка було створено перший у СРСР університетський обчислювальний центр. Метою нового підрозділу стало консолідувати комп’ютерні ресурси для розв’язання наукових і прикладних задач: від математичного моделювання до автоматизації дипломних досліджень. Першою машиною Центру став «Мінськ-22», на якій студенти та викладачі виконували обчислення вручну, обмінюючись магнітними стрічками."
    },
    "section8": {
      "title": "Перехід до клієнт–серверних рішень (1991–2005)",
      "text": "Після відродження незалежної України Центр розширив спектр послуг: з’явилися власні лабораторії по мережевому адмініструванню та базах даних. У 1995 році було встановлено перший сервер UNIX, що дозволило запровадити клієнт–серверні архітектури для наукових проєктів із геофізики та обчислювальної лінгвістики. Одночасно розпочалися курси з C/C++, Java та пізніше — з Python, відкриваючи доступ до міжнародних стандартів програмування."
    }
  },
  "scrollTop": "Прогорнути вгору"
}
=======
{
  "homepage": "Головна",
  "historypage": "Історія",
  "title": "Історія ІОЦ",
  "back": "Повернутися на головну",
  "sections": {
    "section1": {
      "title": "ЗАСНУВАННЯ ТА ПЕРШІ РОКИ (1965–1975)",
      "text": "У 1965 році на факультеті кібернетики КНУ імені Тараса Шевченка був створений перший університетський обчислювальний центр в СРСР. Метою нового підрозділу було об’єднання обчислювальних ресурсів для вирішення наукових та прикладних завдань: від математичного моделювання до автоматизації дипломних робіт. Першою машиною центру була 'Мінськ-22', на якій студенти та викладачі виконували обчислення вручну за допомогою магнітних стрічок."
    },
    "section2": {
      "title": "РОЗБУДОВА ІНФРАСТРУКТУРИ ТА КАДРІВ (1976–1990)",
      "text": "У 1978 році було завершено будівництво окремої адміністративної будівлі на вулиці Володимирській з сучасними обчислювальними залами та читальними кімнатами. Це дозволило збільшити кількість одночасно підключених користувачів з 30 до 200. Центр активно впроваджував операційну систему ЄС ЕОМ, створював локальні мережі на базі комп’ютера 'Універсал-1' і організовував перші курси програмування для викладачів і студентів."
    },
    "section3": {
      "title": "ПЕРЕХІД ДО КЛІЄНТ–СЕРВЕРНИХ РІШЕНЬ (1991–2005)",
      "text": "Після відновлення незалежності України Центр розширив спектр послуг: були створені лабораторії з адміністрування мереж і баз даних. У 1995 році було встановлено перший сервер на UNIX, що дозволило реалізувати клієнт–серверні архітектури для наукових проєктів у галузях геофізики та комп’ютерної лінгвістики. Паралельно було запроваджено курси з мов C/C++, Java, а згодом і Python, що дало змогу вийти на міжнародні стандарти програмування."
    },
    "section4": {
      "title": "ЦИФРОВА ТРАНСФОРМАЦІЯ (2006–2015)",
      "text": "У цей період Центр зосередився на цифровізації внутрішніх університетських сервісів. Були створені перші вебпортали для студентів і викладачів, а поштові служби переведено на захищену внутрішню інфраструктуру. Завдяки віртуалізації та централізованому зберіганню даних покращилась якість надання ІТ-послуг."
    },
    "section5": {
      "title": "МОДЕРНІЗАЦІЯ ТА ХМАРНІ ТЕХНОЛОГІЇ (2016–2020)",
      "text": "З поширенням хмарних технологій Центр почав інтегрувати гібридні хмарні сервіси в екосистему університету. Було впроваджено автоматичне резервне копіювання, доступ до ліцензійного програмного забезпечення та цифрову ідентифікацію користувачів. ІТ-інфраструктура оптимізувалася з акцентом на масштабованість і безпеку."
    },
    "section6": {
      "title": "СТІЙКІСТЬ ТА ПІДТРИМКА ДИСТАНЦІЙНОЇ РОБОТИ (2020–2022)",
      "text": "У відповідь на глобальну пандемію Центр оперативно адаптував системи для підтримки дистанційного навчання та роботи. Були впроваджені VPN-сервіси, хмарні інструменти співпраці та захищені методи автентифікації. Співробітники забезпечували цілодобову підтримку для безперервного функціонування навчального процесу."
    },
    "section7": {
      "title": "ІННОВАЦІЇ ТА КІБЕРБЕЗПЕКА (2023–СЬОГОДНІ)",
      "text": "Сьогодні ІОЦ зосереджується на створенні стійкого, захищеного та інноваційного ІТ-середовища. Впроваджуються сучасні протоколи кібербезпеки, моделі доступу на основі довіри (zero trust) та системи моніторингу на базі ШІ. Центр і надалі відіграє ключову роль у цифровій трансформації університету."
    }
  },
  "scrollTop": "Прокрутити вгору"
}
>>>>>>> 3ca19c0b022fb4409399beab55d7226d62562f9e
